JBarnaky/ESP32-CAM/motionDetect.cpp
    // Compute row strides as 16-bit values to minimize register pressure on embedded targets.
    const uint16_t inputStride = static_cast<uint16_t>(inputWidth) * static_cast<uint16_t>(colorDepth);
    const uint16_t outputStride = static_cast<uint16_t>(outputWidth) * static_cast<uint16_t>(colorDepth);

    // Determine maximum accumulator values to clamp coordinates within image boundaries.
    const uint32_t yMaxAcc = (static_cast<uint32_t>(inputHeight) - 1) << SHIFT8;
    const uint32_t xMaxAcc = (static_cast<uint32_t>(inputWidth) - 1) << SHIFT8;

    uint32_t yAcc = 0;
    uint8_t* outBase = output;

    // Iterate through output rows using a fixed-point accumulator to drive interpolation steps.
    while (true) {
        // Clamp vertical accumulator to prevent reading past the last valid input row.
        if (yAcc > yMaxAcc) yAcc = yMaxAcc;

        // Extract integer indices and fractional weights from the vertical accumulator.
        const uint16_t yL = static_cast<uint16_t>(yAcc >> SHIFT8);
        const uint16_t yH = (yL + 1 < static_cast<uint16_t>(inputHeight)) ? (yL + 1) : yL;
        const uint8_t  yFrac = static_cast<uint8_t>(yAcc & WEIGHT_MASK);

        // Calculate base pointers for the top and bottom source rows involved in this output line.
        const uint8_t* rowL = input + (static_cast<size_t>(yL) * inputStride);
        const uint8_t* rowH = input + (static_cast<size_t>(yH) * inputStride);
        uint8_t* outRow = outBase;

        uint32_t xAcc = 0;

        // Iterate through output columns using a horizontal fixed-point accumulator.
        while (true) {
            // Clamp horizontal accumulator to prevent reading past the last valid input column.
            if (xAcc > xMaxAcc) xAcc = xMaxAcc;

            // Extract integer indices and fractional weights from the horizontal accumulator.
            const uint16_t xL = static_cast<uint16_t>(xAcc >> SHIFT8);
            const uint16_t xH = (xL + 1 < static_cast<uint16_t>(inputWidth)) ? (xL + 1) : xL;
            const uint8_t  xFrac = static_cast<uint8_t>(xAcc & WEIGHT_MASK);

            // Resolve pointers to the four corners of the bilinear sampling neighborhood.
            const uint8_t* pTL = rowL + (static_cast<size_t>(xL) * colorDepth);
            const uint8_t* pTR = rowL + (static_cast<size_t>(xH) * colorDepth);
            const uint8_t* pBL = rowH + (static_cast<size_t>(xL) * colorDepth);
            const uint8_t* pBR = rowH + (static_cast<size_t>(xH) * colorDepth);

            // Process each color channel independently using bilinear interpolation logic.
            int k = 0;
            while (k < colorDepth) {
                // Load pixel values from the four corners of the sampling grid.
                const uint8_t a = pTL[k];
                const uint8_t b = pTR[k];
                const uint8_t c = pBL[k];
                const uint8_t d = pBR[k];

                // Perform linear interpolation along the horizontal axis for both top and bottom pairs.
                int32_t val_top = (static_cast<int32_t>(a) << SHIFT8) +
                    (static_cast<int32_t>(b - a) * static_cast<int32_t>(xFrac));
                int32_t val_bot = (static_cast<int32_t>(c) << SHIFT8) +
                    (static_cast<int32_t>(d - c) * static_cast<int32_t>(xFrac));

                // Perform linear interpolation along the vertical axis between the intermediate results.
                int32_t total = (val_top << SHIFT8) +
                    (static_cast<int32_t>(val_bot - val_top) * static_cast<int32_t>(yFrac));

                // Apply rounding bias, shift down, and store the final 8-bit pixel value.
                *outRow++ = static_cast<uint8_t>((total + ROUNDING_OFFSET) >> 16);

                k++;
            }

            // Increment the horizontal accumulator to advance to the next output column.
            xAcc += xRatio;

            // Terminate loop once the accumulator exceeds the maximum valid coordinate bound.
            if (xAcc > xMaxAcc) break;
        }

        // Increment the vertical accumulator and advance the output buffer pointer to the next row.
        yAcc += yRatio;
        outBase += outputStride;

        // Terminate loop once the accumulator exceeds the maximum valid row coordinate bound.
        if (yAcc > yMaxAcc) break;
    }
}

static inline void rgbToGray(uint8_t* buffer, int width, int height) {
    // Guard against invalid inputs to prevent undefined behavior.
    if (!buffer || width <= 0 || height <= 0) return;

    int totalPixels = width * height;
    const uint8_t* src = buffer;
    uint8_t* dst = buffer;

    // Fixed-point coefficients scaled by 256 for integer-only arithmetic.
    enum : uint32_t {
        COEF_R = 77,
        COEF_G = 150,
        COEF_B = 29
    };

    // Decrementing while-loop eliminates loop counter overhead.
    while (totalPixels--) {
        // Load RGB components and advance source pointer simultaneously.
        uint8_t r = *src++;
        uint8_t g = *src++;
        uint8_t b = *src++;

        // Accumulate weighted sum
        uint32_t gray_val = (COEF_R * r + COEF_G * g + COEF_B * b);

        // Normalize fixed-point result and store grayscale value.
        *dst++ = (uint8_t)(gray_val >> 8);
    }
}

#if INCLUDE_TINYML

static int getImageData(size_t offset, size_t length, float *out_ptr) {
  // copy to features as grayscale or RGB
  size_t pixelPtr = offset * colorDepth;
  size_t out_ptr_idx = 0;
  while (out_ptr_idx < length) {
    out_ptr[out_ptr_idx++] = (colorDepth == RGB888_BYTES)  
      ? (float)((currBuff[pixelPtr] << 16) + (currBuff[pixelPtr + 1] << 8) + currBuff[pixelPtr + 2])
      : (float)((currBuff[pixelPtr] << 16) + (currBuff[pixelPtr] << 8) + currBuff[pixelPtr]);  
    pixelPtr += colorDepth;
  } 
  return 0;
}

static bool tinyMLclassify() {
  // convert input data to appropriate format
  bool out = false;
  uint32_t dTime = millis(); 
  // reduce size of bitmap to that required by classifier and copy to features as grayscale or RGB
  if (RESIZE_DIM != EI_CLASSIFIER_INPUT_WIDTH) {
    size_t tempSize = EI_CLASSIFIER_INPUT_WIDTH * EI_CLASSIFIER_INPUT_HEIGHT * colorDepth;
    uint8_t* tempBuff = (uint8_t*)ps_malloc(tempSize);
    rescaleImage(currBuff, RESIZE_DIM, RESIZE_DIM, tempBuff, EI_CLASSIFIER_INPUT_WIDTH, EI_CLASSIFIER_INPUT_HEIGHT);
    memcpy(currBuff, tempBuff, tempSize);
    free(tempBuff);
  }
  signal_t features_signal;
  features_signal.total_length = EI_CLASSIFIER_INPUT_WIDTH * EI_CLASSIFIER_INPUT_HEIGHT;
  features_signal.get_data = &getImageData;

  // Run the classifier
  ei_impulse_result_t result = { 0 };
  EI_IMPULSE_ERROR res = run_classifier(&features_signal, &result, false);
  if (res == EI_IMPULSE_OK) {
    if (result.classification[0].value > mlProbability) {
      out = true; // sufficient classification match, so keep motion detection
      if (dbgVerbose) {
        LOG_VRB("Prob: %0.2f, Timing: DSP %d ms, inference %d ms, anomaly %d ms", 
        result.classification[0].value, result.timing.dsp, result.timing.classification, result.timing.anomaly);
        char outcome[200] = {0};
        for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++)
          sprintf(outcome + strlen(outcome), "%s: %.2f, ", ei_classifier_inferencing_categories[i], result.classification[i].value);
        LOG_VRB("Predictions - %s in %ums", outcome, millis() - dTime);
      } 
    } 
  } else LOG_WRN("Failed to run classifier (%d)", res);
  return out;
}
#endif

bool checkMotion(camera_fb_t* fb, bool motionStatus, bool lightLevelOnly) {
  // check difference between current and previous image (subtract background)
  // convert image from JPEG to downscaled RGB888 or 8 bit grayscale bitmap
  if (fsizePtr > FRAMESIZE_SXGA) return false;
  uint32_t dTime = millis();
  uint32_t lux = 0;
  static uint32_t motionCnt = 0;
  static uint8_t fsizePtrPrev = 255; // initially invalid to force setup on first call
  static uint8_t scaling, downsize;
  static uint16_t reducer;
  static int sampleWidth = 0, sampleHeight = 0;
  static uint8_t* rgbBuf = (uint8_t*)heap_caps_aligned_calloc(16, 1, frameData[FRAMESIZE_SXGA].frameWidth * frameData[FRAMESIZE_SXGA].frameHeight * RGB888_BYTES / 8, MALLOC_CAP_SPIRAM); // must be 16 byte aligned. Max size, no need to free
 #if INCLUDE_NEW_JPG
  static struct esp_jpeg_stream jpegHandle = {0};
  static uint8_t* jpgBuf = (uint8_t*)ps_malloc(RESIZE_DIM_SQ * RGB888_BYTES);
#endif  

  // calculate parameters for sample size when resolution changes
  if (fsizePtr != fsizePtrPrev) {
    fsizePtrPrev = fsizePtr;
    scaling = frameData[fsizePtr].scaleFactor; 
    reducer = frameData[fsizePtr].sampleRate;
    downsize = pow(2, scaling) * reducer;
    stride = (colorDepth == RGB888_BYTES) ? GRAYSCALE_BYTES : RGB888_BYTES; // stride is inverse of colorDepth
    sampleWidth = frameData[fsizePtr].frameWidth / downsize;
    sampleHeight = frameData[fsizePtr].frameHeight / downsize;
#if INCLUDE_NEW_JPG
    jpg2rgbClose(&jpegHandle);
    jpgReduce(fb->width, fb->height, downsize, &sampleWidth, &sampleHeight);
    if (!jpg2rgbOpen(&jpegHandle, sampleWidth, sampleHeight)) return motionStatus;
#endif
  }
#if INCLUDE_NEW_JPG
  if (!jpg2rgb(&jpegHandle, fb->buf, fb->len, rgbBuf)) return motionStatus;
#else
  if (!jpg2rgb((uint8_t*)fb->buf, fb->len, rgbBuf, scaling)) return motionStatus;
#endif

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  if (colorDepth == GRAYSCALE_BYTES) rgbToGray(rgbBuf, sampleWidth, sampleHeight);
#endif
  LOG_VRB("JPEG to rescaled %s bitmap conversion %u bytes in %lums", colorDepth == RGB888_BYTES ? "color" : "grayscale", sampleWidth * sampleHeight * colorDepth, millis() - dTime);
  
