JBarnaky/ESP32-CAM/motionDetect.cpp
  // Round the larger dimension up to the nearest multiple of 8.
  newLarger = roundUpToMultiple(inWidth, roundTo8);
  
  // Calculate the new smaller based on the new larger and original aspect ratio, then round up.
  newSmaller = (int)(ceil((float)newLarger / aspectRatio));
  newSmaller = roundUpToMultiple(newSmaller, roundTo8);

  // update the values to return
  *outWidth = newLarger;
  *outHeight = newSmaller;
  if (inWidth < inHeight) {
    *outWidth = newSmaller;
    *outHeight = newLarger;
  }
}

static bool jpg2rgbOpen(esp_jpeg_stream_handle_t jpegHandle, uint16_t width, uint16_t height) {
  // configure jpeg handler
  jpeg_dec_config_t config = DEFAULT_JPEG_DEC_CONFIG();
  config.output_type = JPEG_PIXEL_FORMAT_RGB888;
  config.rotate = JPEG_ROTATE_0D;
  config.scale.width = width;
  config.scale.height = height;
  jpegHandle->output_type = JPEG_PIXEL_FORMAT_RGB888;

  // Create jpeg_dec handle
  jpeg_error_t ret = jpeg_dec_open(&config, &jpegHandle->jpeg_dec);
  if (ret != JPEG_ERR_OK) {
    LOG_ERR("Unable to create jpeg decoder handle: %d", ret);
    return false;
  }

  // Create io_callback handle
  jpegHandle->jpeg_io = (jpeg_dec_io_t*)calloc(1, sizeof(jpeg_dec_io_t));
  if (jpegHandle->jpeg_io == NULL) {
    LOG_ERR("Insufficient memory to create input handle");
    jpg2rgbClose(jpegHandle);
    return false;
  }

  // Create out_info handle
  jpegHandle->out_info = (jpeg_dec_header_info_t*)calloc(1, sizeof(jpeg_dec_header_info_t));
  if (jpegHandle->out_info == NULL) {
    LOG_ERR("Insufficient memory to create output handle");
    jpg2rgbClose(jpegHandle);
    return false;
  }
  return true;
}

static bool jpg2rgb(esp_jpeg_stream_handle_t jpegHandle, uint8_t* inputBuf, int inputLen, uint8_t* outputBuf) {
  // decode jpeg to rgb888
  // Set input buffer and buffer len to io_callback
  jpegHandle->jpeg_io->inbuf = inputBuf;
  jpegHandle->jpeg_io->inbuf_len = inputLen;

  // Parse jpeg header and get image for decoder
  jpeg_error_t ret = jpeg_dec_parse_header(jpegHandle->jpeg_dec, jpegHandle->jpeg_io, jpegHandle->out_info);
  if (ret != JPEG_ERR_OK) {
    LOG_ERR("Failed to parse jpeg header: %d", ret);
    return false;
  }

  // decode jpeg into outputBuf
  jpegHandle->jpeg_io->outbuf = outputBuf;
  ret = jpeg_dec_process(jpegHandle->jpeg_dec, jpegHandle->jpeg_io);
  if (ret != JPEG_ERR_OK) {
    LOG_ERR("Failed to decode jpeg: %d", ret);
    return false;
  }
  return true;
}

static bool jpg2rgbClose(esp_jpeg_stream_handle_t jpegHandle) {
   // remove old stream handles when resolution changes
  jpeg_error_t ret = jpeg_dec_close(jpegHandle->jpeg_dec);
  if (jpegHandle->jpeg_io) free(jpegHandle->jpeg_io);
  if (jpegHandle->out_info) free(jpegHandle->out_info);
  return ret == JPEG_ERR_OK;
}

static size_t rgb2jpg(uint8_t* rgb888, int width, int height, int qual, uint8_t* outputBuf) {
  // encode rgb888 to jpeg
  static bool firstCall = true;
  static jpeg_enc_handle_t jpeg_enc = NULL;
  static int bufLen = width * height * RGB888_BYTES;
  jpeg_error_t ret = JPEG_ERR_OK;

  if (firstCall) {
    firstCall = false;
    // configure encoder
    jpeg_enc_config_t jpeg_enc_cfg = DEFAULT_JPEG_ENC_CONFIG();
    jpeg_enc_cfg.width = width;
    jpeg_enc_cfg.height = height;
    jpeg_enc_cfg.src_type = JPEG_PIXEL_FORMAT_RGB888;
    jpeg_enc_cfg.subsampling = JPEG_SUBSAMPLE_420;
    jpeg_enc_cfg.quality = qual;
    jpeg_enc_cfg.rotate = JPEG_ROTATE_0D;
    jpeg_enc_cfg.task_enable = false;
    jpeg_enc_cfg.hfm_task_priority = 13;
    jpeg_enc_cfg.hfm_task_core = 1;

    // open encoder
    ret = jpeg_enc_open(&jpeg_enc_cfg, &jpeg_enc);
    if (ret != JPEG_ERR_OK) {
      LOG_ERR("Failed to open decoder: %d", ret);
      return 0;
    }
  }

  // encoding
  int jpgLen = 0;
  ret = jpeg_enc_process(jpeg_enc, rgb888, bufLen, outputBuf, bufLen, &jpgLen);
  if (ret != JPEG_ERR_OK) LOG_ERR("Failed to encode: %d", ret);

  //jpeg_enc_close(jpeg_enc); // keep open
  return (size_t)jpgLen;
}

#else

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)

// based on jpg2rgb888() from esp32-camera/to_bmp.c for access to rescaling

static uint8_t work[3100]; // Default size is 3.1kB for JPEG decoder

static bool jpg2rgb(const uint8_t* src, size_t src_len, uint8_t* out, uint8_t scale) {
  esp_jpeg_image_cfg_t jpeg_cfg = {
      .indata = (uint8_t *)src,
      .indata_size = src_len,
      .outbuf = out,
      .outbuf_size = UINT32_MAX, // sic @todo: this is very bold assumption, keeping this like this for now, not to break existing code
      .out_format = JPEG_IMAGE_FORMAT_RGB888,
      .out_scale = (esp_jpeg_image_scale_t)scale,
      .flags = {.swap_color_bytes = 0},
      .advanced = {
        .working_buffer = work,
        .working_buffer_size = sizeof(work)
      }
  };
  esp_jpeg_image_output_t output_img = {};
  esp_err_t res = esp_jpeg_decode(&jpeg_cfg, &output_img);
  if (res != ESP_OK) LOG_WRN("jpg2rgb failure: %s", espErrMsg(res)); 
  return (res == ESP_OK);
}

#else

// for arduino-esp32 versions 3.2.1 or earlier

/************* copied and modified from esp32-camera/to_bmp.c to access jpg_scale_t *****************/

typedef struct {
  uint16_t width;
  uint16_t height;
  uint16_t data_offset;
  const uint8_t *input;
  uint8_t *output;
} rgb_jpg_decoder;

// copy_color_row: Converts BGR source data to RGB destination using a decrementing while loop.
static inline void copy_color_row(const uint8_t* __restrict src,
    uint8_t* __restrict dst,
    uint16_t pixel_cnt) noexcept
{
    // Decrementing while loop avoids index multiplication and relies on single zero-test.
    while (pixel_cnt--) {
        // Swap BGR to RGB by reversing byte order.
        dst[0] = src[2];
        dst[1] = src[1];
        dst[2] = src[0];

        // Advance pointers by one pixel (3 bytes).
        src += RGB888_BYTES;
        dst += RGB888_BYTES;
    }
}

// copy_gray_row: Converts RGB source data to grayscale average using fixed-point arithmetic.
static inline void copy_gray_row(const uint8_t* __restrict src,
    uint8_t* __restrict dst,
    uint16_t pixel_cnt) noexcept
{
    // Fixed-point magic constant for efficient division by 3: (sum * 0x5556) >> 16.
    constexpr uint32_t DIV3_MUL = 0x5556u;

    // Decrementing while loop minimizes instruction overhead per pixel.
    while (pixel_cnt--) {
        // Accumulate RGB channels; uint16_t safely holds max sum of 765.
        uint16_t sum = static_cast<uint16_t>(src[0]) +
            static_cast<uint16_t>(src[1]) +
            static_cast<uint16_t>(src[2]);

        // Compute grayscale average via fixed-point multiplication and shift.
        *dst++ = static_cast<uint8_t>((static_cast<uint32_t>(sum) * DIV3_MUL) >> 16u);

        // Advance source pointer by one pixel (3 bytes).
        src += RGB888_BYTES;
    }
}

// _rgb_write: Optimized tile writer with branch hoisting and reduced integer types.
static bool _rgb_write(void* __restrict arg,
    uint16_t x, uint16_t y,
    uint16_t w, uint16_t h,
    const uint8_t* __restrict data) noexcept
{
    // Validate decoder context pointer.
    auto* jpeg = static_cast<rgb_jpg_decoder*>(arg);
    if (!jpeg) {
        return false;
    }

    // Store image dimensions on initial metadata call (null data).
    if (!data) {
        if (x == 0 && y == 0) {
            jpeg->width = w;
            jpeg->height = h;
        }
        return true;
    }

    // Ensure write region bounds do not exceed allocated buffer dimensions.
    if (static_cast<uint32_t>(x) + w > jpeg->width ||
        static_cast<uint32_t>(y) + h > jpeg->height) {
        return false;
    }

    // Determine output format: use minimal types to reduce register pressure.
    constexpr uint8_t srcBpp = RGB888_BYTES;
    const uint8_t dstBpp = static_cast<uint8_t>(colorDepth);
    const bool isColor = (dstBpp == srcBpp);

    // Calculate row strides in bytes; uint16_t is sufficient for VGA/SVGA resolutions.
    const uint16_t srcLineBytes = w * srcBpp;
    const uint16_t dstLineStride = jpeg->width * RGB888_BYTES;

