JBarnaky/ESP32-CAM/motionDetect.cpp
    // Compute base destination address and tile offset using 32-bit math to prevent overflow.
    uint8_t* const dstBase = jpeg->output + jpeg->data_offset;
    const uint32_t dstRowStartOffset = static_cast<uint32_t>(y) * dstLineStride +
        static_cast<uint32_t>(x) * RGB888_BYTES;

    uint8_t* dstRowPtr = dstBase + dstRowStartOffset;
    const uint8_t* srcRowPtr = data;

    // Hoist color/gray branch outside loop to eliminate per-row conditional checks.
    if (isColor) {
        // Process color rows: convert BGR to RGB.
        while (h--) {
            copy_color_row(srcRowPtr, dstRowPtr, w);
            srcRowPtr += srcLineBytes;
            dstRowPtr += dstLineStride;
        }
    }
    else {
        // Process grayscale rows: convert RGB to average intensity.
        while (h--) {
            copy_gray_row(srcRowPtr, dstRowPtr, w);
            srcRowPtr += srcLineBytes;
            dstRowPtr += dstLineStride;
        }
    }

    return true;
}

static unsigned int _jpg_read(void * arg, size_t index, uint8_t *buf, size_t len) {
  rgb_jpg_decoder * jpeg = (rgb_jpg_decoder *)arg;
  if (buf) memcpy(buf, jpeg->input + index, len);
  return len;
}

static bool jpg2rgb(const uint8_t* src, size_t src_len, uint8_t* out, uint8_t scale) {
  rgb_jpg_decoder jpeg;
  jpeg.width = 0;
  jpeg.height = 0;
  jpeg.input = src;
  jpeg.output = out;
  jpeg.data_offset = 0;
  esp_err_t res = esp_jpg_decode(src_len, (jpg_scale_t)scale, _jpg_read, _rgb_write, (void*)&jpeg);
  if (res != ESP_OK) LOG_WRN("jpg2rgb failure: %s", espErrMsg(res)); 
  return (res == ESP_OK);
}

#endif // ESP_ARDUINO_VERSION

#endif // INCLUDE_NEW_JPG

#else 
// dummies
bool isNight(uint8_t nightSwitch) {return false;}

#endif // AUXILIARY

